{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from typing import Dict, List, Optional"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>building_name</th>\n",
       "      <th>area_name</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "      <th>transport</th>\n",
       "      <th>metro_stations</th>\n",
       "      <th>gyms</th>\n",
       "      <th>spas</th>\n",
       "      <th>supermarkets</th>\n",
       "      <th>malls</th>\n",
       "      <th>schools</th>\n",
       "      <th>restaurant</th>\n",
       "      <th>hospital</th>\n",
       "      <th>tourist_attraction</th>\n",
       "      <th>park</th>\n",
       "      <th>worship</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Delphine, Dubai Marina</td>\n",
       "      <td>Dubai Marina</td>\n",
       "      <td>25.073213</td>\n",
       "      <td>55.132712</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'R...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'D...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'T...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'C...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'W...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'I...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'A...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'L...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'A...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'D...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'S...</td>\n",
       "      <td>[{'business_status': 'CLOSED_TEMPORARILY', 'na...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Marina Plaza, Dubai Marina</td>\n",
       "      <td>Dubai Marina</td>\n",
       "      <td>25.075398</td>\n",
       "      <td>55.139825</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'R...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'D...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'T...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'C...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'W...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'I...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'A...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'L...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'A...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'Q...</td>\n",
       "      <td>[{'business_status': 'OPERATIONAL', 'name': 'S...</td>\n",
       "      <td>[{'business_status': 'CLOSED_TEMPORARILY', 'na...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                building_name     area_name   latitude  longitude  \\\n",
       "0      Delphine, Dubai Marina  Dubai Marina  25.073213  55.132712   \n",
       "1  Marina Plaza, Dubai Marina  Dubai Marina  25.075398  55.139825   \n",
       "\n",
       "                                           transport  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'R...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'R...   \n",
       "\n",
       "                                      metro_stations  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'D...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'D...   \n",
       "\n",
       "                                                gyms  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'T...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'T...   \n",
       "\n",
       "                                                spas  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'C...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'C...   \n",
       "\n",
       "                                        supermarkets  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'W...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'W...   \n",
       "\n",
       "                                               malls  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'I...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'I...   \n",
       "\n",
       "                                             schools  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'A...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'A...   \n",
       "\n",
       "                                          restaurant  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'L...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'L...   \n",
       "\n",
       "                                            hospital  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'A...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'A...   \n",
       "\n",
       "                                  tourist_attraction  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'D...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'Q...   \n",
       "\n",
       "                                                park  \\\n",
       "0  [{'business_status': 'OPERATIONAL', 'name': 'S...   \n",
       "1  [{'business_status': 'OPERATIONAL', 'name': 'S...   \n",
       "\n",
       "                                             worship  \n",
       "0  [{'business_status': 'CLOSED_TEMPORARILY', 'na...  \n",
       "1  [{'business_status': 'CLOSED_TEMPORARILY', 'na...  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_amneties= pd.read_csv(\"final/final_building_amenities.csv\")\n",
    "df_amneties.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array(['Dubai Marina', 'Business Bay', 'Jumeirah Lake Towers (JLT)',\n",
       "       'Discovery Gardens', 'Dubai Investment Park (DIP)',\n",
       "       'Green Community', 'Dubai Sports City', 'International City',\n",
       "       'Sheikh Zayed Road', 'Dubai Silicon Oasis (DSO)'], dtype=object)"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_amneties[\"area_name\"].unique()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['building_name', 'area_name', 'latitude', 'longitude', 'transport',\n",
       "       'metro_stations', 'gyms', 'spas', 'supermarkets', 'malls', 'schools',\n",
       "       'restaurant', 'hospital', 'tourist_attraction', 'park', 'worship'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_amneties.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0.1</th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>area_name</th>\n",
       "      <th>building_name</th>\n",
       "      <th>url</th>\n",
       "      <th>about</th>\n",
       "      <th>in-a-nutshell</th>\n",
       "      <th>parking</th>\n",
       "      <th>elevators</th>\n",
       "      <th>security,-central-air-conditioning-and-maintenance-services</th>\n",
       "      <th>...</th>\n",
       "      <th>restaurants-near</th>\n",
       "      <th>supermarkets-near</th>\n",
       "      <th>schools-and-nurseries-near</th>\n",
       "      <th>nearby-buildings</th>\n",
       "      <th>major-landmarks</th>\n",
       "      <th>nearby-attractions</th>\n",
       "      <th>things-to-consider</th>\n",
       "      <th>what-type-of-apartments</th>\n",
       "      <th>what-facilities-are-there</th>\n",
       "      <th>faqs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>Dubai Marina</td>\n",
       "      <td>Delphine, Dubai Marina</td>\n",
       "      <td>https://www.bayut.com/buildings/delphine-tower/</td>\n",
       "      <td>Delphine Tower is part of a six-building compl...</td>\n",
       "      <td>Type of building: Residential\\nLocation: Dubai...</td>\n",
       "      <td>There is parking in Delphine Tower for residen...</td>\n",
       "      <td>There are multiple high-speed elevators in Del...</td>\n",
       "      <td>Delphine Tower has CCTV cameras installed as o...</td>\n",
       "      <td>...</td>\n",
       "      <td>Restaurants near Delphine Tower Dubai Marina i...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Buildings near Delphine Tower Dubai Marina inc...</td>\n",
       "      <td>Major Landmarks near Delphine Tower Dubai Mari...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Delphine Tower is a complex that redefines lux...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 37 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   Unnamed: 0.1  Unnamed: 0     area_name           building_name  \\\n",
       "0             0           0  Dubai Marina  Delphine, Dubai Marina   \n",
       "\n",
       "                                               url  \\\n",
       "0  https://www.bayut.com/buildings/delphine-tower/   \n",
       "\n",
       "                                               about  \\\n",
       "0  Delphine Tower is part of a six-building compl...   \n",
       "\n",
       "                                       in-a-nutshell  \\\n",
       "0  Type of building: Residential\\nLocation: Dubai...   \n",
       "\n",
       "                                             parking  \\\n",
       "0  There is parking in Delphine Tower for residen...   \n",
       "\n",
       "                                           elevators  \\\n",
       "0  There are multiple high-speed elevators in Del...   \n",
       "\n",
       "  security,-central-air-conditioning-and-maintenance-services  ...  \\\n",
       "0  Delphine Tower has CCTV cameras installed as o...           ...   \n",
       "\n",
       "                                    restaurants-near supermarkets-near  \\\n",
       "0  Restaurants near Delphine Tower Dubai Marina i...               NaN   \n",
       "\n",
       "  schools-and-nurseries-near  \\\n",
       "0                        NaN   \n",
       "\n",
       "                                    nearby-buildings  \\\n",
       "0  Buildings near Delphine Tower Dubai Marina inc...   \n",
       "\n",
       "                                     major-landmarks nearby-attractions  \\\n",
       "0  Major Landmarks near Delphine Tower Dubai Mari...                NaN   \n",
       "\n",
       "                                  things-to-consider what-type-of-apartments  \\\n",
       "0  Delphine Tower is a complex that redefines lux...                     NaN   \n",
       "\n",
       "  what-facilities-are-there faqs  \n",
       "0                       NaN  NaN  \n",
       "\n",
       "[1 rows x 37 columns]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_buildings_info= pd.read_csv(\"final/final_building_info.csv\")\n",
    "df_buildings_info.head(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array(['Dubai Marina', 'Business Bay', 'Discovery Gardens',\n",
       "       'Dubai Investment Park (DIP)', 'Green Community',\n",
       "       'Dubai Sports City', 'International City', 'Sheikh Zayed Road',\n",
       "       'Dubai Silicon Oasis (DSO)'], dtype=object)"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_buildings_info[\"area_name\"].unique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>about-</th>\n",
       "      <th>in-a-nutshell</th>\n",
       "      <th>community-overview</th>\n",
       "      <th>properties-in</th>\n",
       "      <th>transportation-and-parking-spaces</th>\n",
       "      <th>supermarkets-near</th>\n",
       "      <th>mosques-near</th>\n",
       "      <th>other-places-of-worship</th>\n",
       "      <th>schools-near</th>\n",
       "      <th>...</th>\n",
       "      <th>outdoor-activities,-fitness-and-beauty</th>\n",
       "      <th>community-events</th>\n",
       "      <th>social-community-groups</th>\n",
       "      <th>things-to-consider</th>\n",
       "      <th>location_x</th>\n",
       "      <th>area</th>\n",
       "      <th>img_name</th>\n",
       "      <th>location_y</th>\n",
       "      <th>sub_location</th>\n",
       "      <th>status</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Marina Quays in Dubai Marina is a multi-buildi...</td>\n",
       "      <td>Type of building: Residential\\nLocation: Dubai...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Supermarkets and convenience stores near Marin...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Dubai Marina Quays East Location allows reside...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Marina Quays East, Dubai Marina</td>\n",
       "      <td>Marina Quays East, Dubai Marina</td>\n",
       "      <td>Dubai Marina</td>\n",
       "      <td>Marina Quays East</td>\n",
       "      <td>Ready</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 26 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   Unnamed: 0                                             about-  \\\n",
       "0           0  Marina Quays in Dubai Marina is a multi-buildi...   \n",
       "\n",
       "                                       in-a-nutshell community-overview  \\\n",
       "0  Type of building: Residential\\nLocation: Dubai...                NaN   \n",
       "\n",
       "  properties-in transportation-and-parking-spaces  \\\n",
       "0           NaN                               NaN   \n",
       "\n",
       "                                   supermarkets-near mosques-near  \\\n",
       "0  Supermarkets and convenience stores near Marin...          NaN   \n",
       "\n",
       "  other-places-of-worship schools-near  ...  \\\n",
       "0                     NaN          NaN  ...   \n",
       "\n",
       "  outdoor-activities,-fitness-and-beauty community-events  \\\n",
       "0                                    NaN              NaN   \n",
       "\n",
       "  social-community-groups                                 things-to-consider  \\\n",
       "0                     NaN  Dubai Marina Quays East Location allows reside...   \n",
       "\n",
       "  location_x                             area  \\\n",
       "0        NaN  Marina Quays East, Dubai Marina   \n",
       "\n",
       "                          img_name    location_y       sub_location status  \n",
       "0  Marina Quays East, Dubai Marina  Dubai Marina  Marina Quays East  Ready  \n",
       "\n",
       "[1 rows x 26 columns]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_areas_info= pd.read_csv(\"final/final_areas_info.csv\")\n",
    "df_areas_info.head(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "array(['Dubai Marina', 'Dubai Silicon Oasis', 'International City',\n",
       "       'Dubai Sports City', 'Dubai Investments Park (DIP)',\n",
       "       'Business Bay', 'Discovery Gardens', 'Green Community',\n",
       "       'Sheikh Zayed Road'], dtype=object)"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_areas_info[\"location_y\"].unique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Unnamed: 0', 'about-', 'in-a-nutshell', 'community-overview',\n",
       "       'properties-in', 'transportation-and-parking-spaces',\n",
       "       'supermarkets-near', 'mosques-near', 'other-places-of-worship',\n",
       "       'schools-near', 'clinics-and-hospitals-near', 'nearby-areas',\n",
       "       'malls-near', 'restaurants-near', 'beaches-near',\n",
       "       'leisure-activities-and-notable-landmarks',\n",
       "       'outdoor-activities,-fitness-and-beauty', 'community-events',\n",
       "       'social-community-groups', 'things-to-consider', 'location_x', 'area',\n",
       "       'img_name', 'location_y', 'sub_location', 'status'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_areas_info.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Unnamed: 0.1', 'Unnamed: 0', 'area_name', 'building_name', 'url',\n",
       "       'about', 'in-a-nutshell', 'parking', 'elevators',\n",
       "       'security,-central-air-conditioning-and-maintenance-services', 'gym',\n",
       "       'lifestyle-amenities', 'concierge-and-guest-services', 'pet-friendly',\n",
       "       'apartment-types', 'studio-apartments', '1-bedroom-apartments',\n",
       "       '2-bedroom-apartments', 'most-popular-apartments', 'sales-trends-in',\n",
       "       'rental-yields', 'facilities-in', 'expected-completion-date',\n",
       "       'payment-plan', 'getting-around', 'bus-stations-near', 'metro-stations',\n",
       "       'restaurants-near', 'supermarkets-near', 'schools-and-nurseries-near',\n",
       "       'nearby-buildings', 'major-landmarks', 'nearby-attractions',\n",
       "       'things-to-consider', 'what-type-of-apartments',\n",
       "       'what-facilities-are-there', 'faqs'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_buildings_info.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'test': 1}]\n"
     ]
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "# Make sure these credentials exactly match what you specified in the docker run command\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"1234neo4j\"))\n",
    "\n",
    "# Test the connection with a simple query\n",
    "result = graph.run(\"RETURN 1 as test\").data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "from typing import Dict, List, Optional\n",
    "import ast\n",
    "import json\n",
    "from openai import AzureOpenAI\n",
    "\n",
    "\n",
    "class RealEstateKnowledgeGraph:\n",
    "    \n",
    "    def __init__(self):\n",
    "        import os\n",
    "        from dotenv import load_dotenv\n",
    "        \n",
    "        # Load environment variables from .env file if it exists\n",
    "        load_dotenv()\n",
    "        self.graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"1234neo4j\"))\n",
    "        self.embedding_model = AzureOpenAI(\n",
    "            api_version=\"2024-12-01-preview\",\n",
    "            azure_endpoint=\"https://bodeu-des-csv02.openai.azure.com/\",\n",
    "            api_key = os.getenv(\"AZURE_OPENAI_KEY\")\n",
    "        )\n",
    "        self.embedding_model_name = \"text-embedding-3-small\"\n",
    "    \n",
    "    def get_embedding(self, text):\n",
    "        response = self.embedding_model.embeddings.create(\n",
    "            input=[text],\n",
    "            model=self.embedding_model_name\n",
    "        )\n",
    "        return response.data[0].embedding\n",
    "    \n",
    "    def create_knowledge_graph(self, df_amenities: pd.DataFrame):\n",
    "        # Create constraints for unique nodes\n",
    "        self.graph.run(\"MATCH (n) DETACH DELETE n\")\n",
    "        #'transport','metro_stations', 'gyms', 'spas', 'supermarkets', 'malls', 'schools','restaurant', 'hospital', 'tourist_attraction', 'park', 'worship'\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (a:Area) REQUIRE a.name IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (b:Building) REQUIRE b.name IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (s:School) REQUIRE (s.name, s.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (m:MetroStation) REQUIRE (m.name, m.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (h:Hospital) REQUIRE (h.name, h.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (t:Transport) REQUIRE (t.name, t.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (g:Gym) REQUIRE (g.name, g.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (s:SPA) REQUIRE (s.name, s.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (s:Supermarket) REQUIRE (s.name, s.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (m:Mall) REQUIRE (m.name, m.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (r:Restaurant) REQUIRE (r.name, r.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (t:TouristAttraction) REQUIRE (t.name, t.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (p:Park) REQUIRE (p.name, p.vicinity) IS UNIQUE\")\n",
    "        self.graph.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (w:Worship) REQUIRE (w.name, w.vicinity) IS UNIQUE\")\n",
    "\n",
    "\n",
    "        # First, create all areas\n",
    "        areas = df_areas_info['location_y'].unique()\n",
    "        for area_name in areas:\n",
    "            print(area_name)\n",
    "            row = df_areas_info[df_areas_info[\"location_y\"] == area_name].iloc[0]\n",
    "            self._create_area(row)\n",
    "\n",
    "        # Then create buildings and their relationships\n",
    "        for _, row in df_buildings_info.iterrows():\n",
    "            row_amenties_info = df_amneties[df_amneties[\"building_name\"] == row[\"building_name\"]].iloc[0]\n",
    "            self._create_building_with_amenities(row_amenties_info,row)\n",
    "\n",
    "        # ... similar for other amenities ...\n",
    "\n",
    "    def _create_area(self,row):\n",
    "        area_cols = ['about-', 'in-a-nutshell', 'community-overview',\n",
    "       'properties-in', 'transportation-and-parking-spaces',\n",
    "       'supermarkets-near', 'mosques-near', 'other-places-of-worship',\n",
    "       'schools-near', 'clinics-and-hospitals-near', 'nearby-areas',\n",
    "       'malls-near', 'restaurants-near', 'beaches-near',\n",
    "       'leisure-activities-and-notable-landmarks',\n",
    "       'outdoor-activities,-fitness-and-beauty', 'community-events',\n",
    "       'social-community-groups', 'things-to-consider', 'location_x', 'area',\n",
    "       'img_name', 'location_y', 'sub_location', 'status']\n",
    "        \n",
    "        area_details = []\n",
    "        for col in area_cols:\n",
    "            if col in row and pd.notna(row[col]) and row[col]:\n",
    "                area_details.append(f\"{col.replace('-', ' ').title()}: {row[col]}\")\n",
    "        \n",
    "        #area_desc = f\"Area: {row['area']} .\"\n",
    "        #area_desc += \" \".join(area_details)\n",
    "\n",
    "        #embedding = self.get_embedding(area_desc)\n",
    "\n",
    "\n",
    "        query = \"\"\"\n",
    "        MERGE (a:Area {name: $area_name})\n",
    "       \n",
    "        \"\"\"\n",
    "        # Add all available building properties dynamically SET a.description = $description,\n",
    "           # a.embedding = $embedding\n",
    "        params = {\n",
    "            'area_name':row[\"location_y\"]\n",
    "           # 'description': area_desc,\n",
    "            #'embedding': embedding\n",
    "        }\n",
    "        \n",
    "        # Add additional properties if they exist in the row\n",
    "        # for col in area_cols:\n",
    "        #     if col in row and pd.notna(row[col]):\n",
    "        #         # Create a valid property name by replacing hyphens and commas\n",
    "        #         prop_name = col.replace('-', '_').replace(',', '').lower()\n",
    "        #         query += f\",\\n        a.{prop_name} = ${prop_name}\"\n",
    "        #         params[prop_name] = str(row[col])\n",
    "\n",
    "        self.graph.run(query, **params)\n",
    "\n",
    "    def _parse_amenity_string(self, amenity_str) -> List[Dict]:\n",
    "        \"\"\"Convert string representation of amenities to List[Dict]\"\"\"\n",
    "        if pd.isna(amenity_str) or not amenity_str:\n",
    "            return []\n",
    "        try:\n",
    "            # First try using ast.literal_eval\n",
    "            return ast.literal_eval(amenity_str)\n",
    "        except:\n",
    "            try:\n",
    "                # If that fails, try json.loads\n",
    "                return json.loads(amenity_str)\n",
    "            except:\n",
    "                print(f\"Failed to parse amenity string: {amenity_str}\")\n",
    "                return []\n",
    "\n",
    "    def _create_amenity_relationships(\n",
    "        self, building_name: str, amenities: List[Dict],\n",
    "        node_label: str, relationship_type: str\n",
    "    ):\n",
    "        for amenity in amenities:\n",
    "            query = f\"\"\"\n",
    "            MATCH (b:Building {{name: $building_name}})\n",
    "            MERGE (am:{node_label} {{name: $amenity_name, vicinity: $vicinity}})\n",
    "            SET am.business_status = $status,\n",
    "                am.vicinity = $vicinity,\n",
    "                am.latitude = $latitude,\n",
    "                am.longitude = $longitude,\n",
    "                am.rating = $rating,\n",
    "                am.user_ratings_total = $user_ratings_total\n",
    "            MERGE (b)-[:{relationship_type}]->(am)\n",
    "            \"\"\"\n",
    "            self.graph.run(\n",
    "                query,\n",
    "                building_name=building_name,\n",
    "                amenity_name=amenity['name'],\n",
    "                vicinity=amenity['vicinity'],\n",
    "                status=amenity['business_status'],\n",
    "                latitude= float(amenity['latitude']),\n",
    "                longitude=float(amenity['longitude']),\n",
    "                rating= float(amenity['rating']),\n",
    "                user_ratings_total=float(amenity['user_ratings_total']),\n",
    "            )\n",
    "\n",
    "    def query_school_analysis(self) -> List[Dict]:\n",
    "        \"\"\"\n",
    "        Analyze areas and buildings based on school accessibility\n",
    "        \"\"\"\n",
    "        query = \"\"\"\n",
    "        // Match all areas and their buildings\n",
    "        MATCH (a:Area)-[:CONTAINS]->(b:Building)\n",
    "        \n",
    "        // Get schools for each building\n",
    "        OPTIONAL MATCH (b)-[:HAS_SCHOOL]->(s:School)\n",
    "        WHERE s.business_status = 'OPERATIONAL'\n",
    "        \n",
    "        // Get metro stations for additional context\n",
    "        OPTIONAL MATCH (b)-[:HAS_METRO]->(m:MetroStation)\n",
    "        WHERE m.business_status = 'OPERATIONAL'\n",
    "        \n",
    "        // First collect data at the building level\n",
    "        WITH a, b, \n",
    "            COLLECT(DISTINCT {name: s.name, vicinity: s.vicinity}) as building_schools,\n",
    "            COUNT(DISTINCT m) as building_metros\n",
    "        \n",
    "        // Then aggregate by area\n",
    "        WITH a, \n",
    "            COUNT(DISTINCT b) as building_count,\n",
    "            SUM(SIZE(building_schools)) as school_count,\n",
    "            SUM(building_metros) as metro_count,\n",
    "            COLLECT(DISTINCT {\n",
    "                building_name: b.name,\n",
    "                schools: building_schools,\n",
    "                metros: building_metros\n",
    "            }) as buildings\n",
    "        \n",
    "        // Calculate school density score\n",
    "        WITH a, \n",
    "            building_count,\n",
    "            school_count,\n",
    "            metro_count,\n",
    "            buildings,\n",
    "            CASE WHEN building_count > 0 \n",
    "                THEN toFloat(school_count) / building_count \n",
    "                ELSE 0 \n",
    "            END as school_density\n",
    "        \n",
    "        RETURN a.name as area_name,\n",
    "            building_count,\n",
    "            school_count,\n",
    "            metro_count,\n",
    "            school_density,\n",
    "            buildings\n",
    "        ORDER BY school_density DESC\n",
    "        \"\"\"\n",
    "            \n",
    "        result = self.graph.run(query)\n",
    "        return [dict(record) for record in result]\n",
    "    \n",
    "    def _create_building_with_amenities(self, row,row_building_info):\n",
    "        # Generate embeddings for building description\n",
    "        building_info_cols = [\n",
    "            'about', 'in-a-nutshell', 'parking', 'elevators',\n",
    "            'security,-central-air-conditioning-and-maintenance-services', 'gym',\n",
    "            'lifestyle-amenities', 'concierge-and-guest-services', 'pet-friendly',\n",
    "            'apartment-types', 'getting-around', 'nearby-attractions',\n",
    "            'things-to-consider', 'what-type-of-apartments',\n",
    "            'what-facilities-are-there'\n",
    "        ]\n",
    "        building_details = []\n",
    "        for col in building_info_cols:\n",
    "            if col in row_building_info and pd.notna(row_building_info[col]) and row_building_info[col]:\n",
    "                building_details.append(f\"{col.replace('-', ' ').title()}: {row_building_info[col]}\")\n",
    "        \n",
    "        building_desc = f\"Building: {row_building_info['building_name']} in {row_building_info['area_name']}. \"\n",
    "        #building_desc += \" \".join(building_details)\n",
    "\n",
    "        #embedding = self.get_embedding(building_desc)        \n",
    "        # Store building with embedding\n",
    "        # query = \"\"\"\n",
    "        # MATCH (a:Area {name: $area_name})\n",
    "        # MERGE (b:Building {name: $building_name})\n",
    "        # SET b.latitude = $lat,\n",
    "        #     b.longitude = $lng,\n",
    "        #     b.description = $description,\n",
    "        #     b.embedding = $embedding\n",
    "        # \"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (a:Area {name: $area_name})\n",
    "        MERGE (b:Building {name: $building_name})\n",
    "        SET b.latitude = $lat,\n",
    "            b.longitude = $lng\n",
    "        \"\"\"\n",
    "        params = {\n",
    "            'area_name': row['area_name'],\n",
    "            'building_name': row['building_name'],\n",
    "            'lat': float(row['latitude']),\n",
    "            'lng': float(row['longitude'])\n",
    "            #'description': building_desc\n",
    "            #'embedding': embedding\n",
    "        }\n",
    "\n",
    "        # for col in building_info_cols:\n",
    "        #     if col in row_building_info and pd.notna(row_building_info[col]):\n",
    "        #         # Create a valid property name by replacing hyphens and commas\n",
    "        #         prop_name = col.replace('-', '_').replace(',', '').lower()\n",
    "        #         query += f\",\\n        b.{prop_name} = ${prop_name}\"\n",
    "        #         params[prop_name] = str(row_building_info[col])\n",
    "\n",
    "        # Complete the query\n",
    "        #try:\n",
    "        query += \"\\nMERGE (a)-[:CONTAINS]->(b)\"\n",
    "        self.graph.run(query, **params)\n",
    "        \n",
    "        #except:\n",
    "        #    print(query)\n",
    "        #    print(params)\n",
    "        #    raise\n",
    "        # Create amenity relationships\n",
    "        #'transport','metro_stations', 'gyms', 'spas', 'supermarkets', 'malls', 'schools','restaurant', 'hospital', 'tourist_attraction', 'park', 'worship'\n",
    "        amenity_mappings = [\n",
    "            ('transport', 'Transport', 'HAS_TRANSPORT'),\n",
    "            ('gyms', 'Gym', 'HAS_GYM'),\n",
    "            ('spas', 'SPA', 'HAS_SPA'),\n",
    "            ('supermarkets', 'Supermarket', 'HAS_SUPERMARKET'),\n",
    "            ('malls', 'Mall', 'HAS_MALL'),\n",
    "            ('metro_stations', 'MetroStation', 'HAS_METRO'),\n",
    "            ('hospital', 'Hospital', 'HAS_HOSPITAL'),\n",
    "            ('schools', 'School', 'HAS_SCHOOL'),\n",
    "            ('worship', 'Worship', 'HAS_WORSHIP'),\n",
    "            ('restaurant', 'Restaurant', 'HAS_RESTAURANT'),\n",
    "            ('park', 'Park', 'HAS_PARK'),\n",
    "            ('tourist_attraction', 'TouristAttraction', 'HAS_TOURIST_ATTRACTION')\n",
    "        ]\n",
    "\n",
    "        for amenity_field, node_label, relationship_type in amenity_mappings:\n",
    "            if amenity_field in row:\n",
    "                amenities = self._parse_amenity_string(row[amenity_field])\n",
    "                if amenities:  # Only process if we have valid amenities\n",
    "                    self._create_amenity_relationships(\n",
    "                        row['building_name'],\n",
    "                        amenities,\n",
    "                        node_label,\n",
    "                        relationship_type\n",
    "                    )\n",
    "\n",
    "\n",
    "    def semantic_search(self, query_text: str, limit: int = 5):\n",
    "        # Generate embedding for search query\n",
    "        query_embedding = self.embedding_model.encode(query_text)\n",
    "        \n",
    "        # Search using cosine similarity in Neo4j\n",
    "        result = self.graph.run(\"\"\"\n",
    "        MATCH (b:Building)\n",
    "        WITH b, gds.similarity.cosine(b.embedding, $query_embedding) AS similarity\n",
    "        WHERE similarity > 0.5\n",
    "        RETURN b.name, b.description, similarity\n",
    "        ORDER BY similarity DESC\n",
    "        LIMIT $limit\n",
    "        \"\"\", query_embedding=query_embedding.tolist(), limit=limit)\n",
    "        \n",
    "        return [(record[\"b.name\"], record[\"b.description\"], record[\"similarity\"]) \n",
    "                for record in result]\n",
    "\n",
    "    def hybrid_search(self, query_text: str, area_name: str = None, \n",
    "                     min_similarity: float = 0.5, limit: int = 5):\n",
    "        \"\"\"\n",
    "        Combine semantic search with structural queries\n",
    "        \"\"\"\n",
    "        query_embedding = self.embedding_model.encode(query_text)\n",
    "        \n",
    "        # Build dynamic query based on filters\n",
    "        query = \"\"\"\n",
    "        MATCH (b:Building)\n",
    "        \"\"\"\n",
    "        if area_name:\n",
    "            query += \"\"\"\n",
    "            MATCH (a:Area {name: $area_name})-[:CONTAINS]->(b)\n",
    "            \"\"\"\n",
    "        \n",
    "        query += \"\"\"\n",
    "        WITH b, gds.similarity.cosine(b.embedding, $query_embedding) AS similarity\n",
    "        WHERE similarity > $min_similarity\n",
    "        RETURN b.name, b.description, similarity\n",
    "        ORDER BY similarity DESC\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        result = self.graph.run(\n",
    "            query,\n",
    "            query_embedding=query_embedding.tolist(),\n",
    "            area_name=area_name,\n",
    "            min_similarity=min_similarity,\n",
    "            limit=limit\n",
    "        )\n",
    "        \n",
    "        return [(record[\"b.name\"], record[\"b.description\"], record[\"similarity\"]) \n",
    "                for record in result]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Dubai Marina\n",
      "Dubai Silicon Oasis\n",
      "International City\n",
      "Dubai Sports City\n",
      "Dubai Investments Park (DIP)\n",
      "Business Bay\n",
      "Discovery Gardens\n",
      "Green Community\n",
      "Sheikh Zayed Road\n"
     ]
    }
   ],
   "source": [
    "kg = RealEstateKnowledgeGraph()\n",
    "kg.create_knowledge_graph(df_amneties)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_openai import AzureChatOpenAI\n",
    "from langchain_core.tools import tool\n",
    "import os\n",
    "\n",
    "model_name = \"gpt-4o\"\n",
    "deployment = \"azure-gpt-4o\"\n",
    "\n",
    "endpoint = os.getenv(\"AZURE_OPENAI_URL\")\n",
    "subscription_key = os.getenv(\"AZURE_OPENAI_KEY\")\n",
    "api_version = \"2024-12-01-preview\"\n",
    "\n",
    "llm = AzureChatOpenAI(\n",
    "    azure_deployment=deployment,\n",
    "    azure_endpoint=endpoint,\n",
    "    api_version=api_version,  \n",
    "    temperature=0.7,\n",
    "    api_key=subscription_key\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings, ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.prompts import PromptTemplate\n",
    "import os\n",
    "\n",
    "class RealEstateRAG:\n",
    "    def __init__(self,llm,embedding_model ,openai_api_key=None):\n",
    "        # Set up OpenAI API key\n",
    "        #self.api_key = openai_api_key or os.getenv(\"OPENAI_API_KEY\")\n",
    "        #if not self.api_key:\n",
    "        #    raise ValueError(\"OpenAI API key is required\")\n",
    "\n",
    "        # Initialize Neo4j connection\n",
    "        self.graph = Neo4jGraph(\n",
    "            url=\"bolt://localhost:7687\",\n",
    "            username=\"neo4j\",\n",
    "            password=\"1234neo4j\"\n",
    "        )\n",
    "\n",
    "        # Initialize embeddings\n",
    "        self.embeddings = embedding_model #OpenAIEmbeddings(api_key=self.api_key)\n",
    "\n",
    "        # Initialize vector store\n",
    "        # self.vector_store = Neo4jVector.from_existing_graph(\n",
    "        #     embedding=self.embeddings,\n",
    "        #     url=\"bolt://localhost:7687\",\n",
    "        #     username=\"neo4j\",\n",
    "        #     password=\"1234neo4j\",\n",
    "        #     search_type=\"hybrid\",  # Combines vector + keyword search\n",
    "        #     node_label=\"Building\",  # Main node label to search\n",
    "        #     text_node_properties=[\"description\"],  # Property containing text to embed\n",
    "        #     embedding_node_property=\"embedding\"  # Property to store embeddings\n",
    "        # )\n",
    "        self.llm = llm\n",
    "        # Initialize LLM\n",
    "        # self.llm = ChatOpenAI(\n",
    "        #     temperature=0,\n",
    "        #     model=\"gpt-4\",\n",
    "        #     api_key=self.api_key\n",
    "        # )\n",
    "\n",
    "        # Set up the Cypher QA Chain\n",
    "        self.qa_chain = self._setup_qa_chain()\n",
    "\n",
    "    def _setup_qa_chain(self):\n",
    "        # Custom prompt template for real estate queries\n",
    "        CYPHER_PROMPT = \"\"\"Task: Generate a Cypher query to find real estate information based on the question.\n",
    "\n",
    "        Database Schema:\n",
    "        - (Building) nodes with properties: name, description, latitude, longitude, about, in_a_nutshell, etc.\n",
    "        - (Area) nodes with properties: name, description, about_, in_a_nutshell, community_overview, etc.\n",
    "        - Specific amenity nodes:\n",
    "        * (Transport) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Gym) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (SPA) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Supermarket) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Mall) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (MetroStation) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Hospital) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (School) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Worship) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Restaurant) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (Park) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        * (TouristAttraction) with properties: name, business_status, vicinity, latitude, longitude, rating, user_ratings_total\n",
    "        \n",
    "        - Relationships: \n",
    "        * (Area)-[:CONTAINS]->(Building)\n",
    "        * (Building)-[:HAS_TRANSPORT]->(Transport)\n",
    "        * (Building)-[:HAS_GYM]->(Gym)\n",
    "        * (Building)-[:HAS_SPA]->(SPA)\n",
    "        * (Building)-[:HAS_SUPERMARKET]->(Supermarket)\n",
    "        * (Building)-[:HAS_MALL]->(Mall)\n",
    "        * (Building)-[:HAS_METRO]->(MetroStation)\n",
    "        * (Building)-[:HAS_HOSPITAL]->(Hospital)\n",
    "        * (Building)-[:HAS_SCHOOL]->(School)\n",
    "        * (Building)-[:HAS_WORSHIP]->(Worship)\n",
    "        * (Building)-[:HAS_RESTAURANT]->(Restaurant)\n",
    "        * (Building)-[:HAS_PARK]->(Park)\n",
    "        * (Building)-[:HAS_TOURIST_ATTRACTION]->(TouristAttraction)\n",
    "\n",
    "        Question: {question}\n",
    "\n",
    "        Important:\n",
    "        - Consider spatial relationships when relevant\n",
    "        - Include ratings and review counts when available\n",
    "        - Limit results to reasonable numbers (5-10)\n",
    "        - Filter for operational amenities using business_status='OPERATIONAL' when appropriate\n",
    "        - Only generate the Cypher query, no other text\n",
    "\n",
    "        Cypher Query:\"\"\"\n",
    "\n",
    "        cypher_prompt = PromptTemplate(\n",
    "            template=CYPHER_PROMPT,\n",
    "            input_variables=[\"question\"]\n",
    "        )\n",
    "\n",
    "        return GraphCypherQAChain.from_llm(\n",
    "            llm=self.llm,\n",
    "            graph=self.graph,\n",
    "            cypher_prompt=cypher_prompt,\n",
    "            verbose=True,\n",
    "            allow_dangerous_requests=True\n",
    "        )\n",
    "    def answer_query(self, query: str) -> str:\n",
    "        \"\"\"\n",
    "        Process and answer real estate queries using graph capabilities\n",
    "        \"\"\"\n",
    "        try:\n",
    "            # Use the QA chain to get the answer directly\n",
    "            # No vector store needed\n",
    "            response = self.qa_chain.run(query)\n",
    "            return response\n",
    "\n",
    "        except Exception as e:\n",
    "            return f\"Error processing query: {str(e)}\"\n",
    "    def answer_query___(self, query: str) -> str:\n",
    "        \"\"\"\n",
    "        Process and answer real estate queries using both vector and graph capabilities\n",
    "        \"\"\"\n",
    "        try:\n",
    "            # First, try to get relevant context using vector similarity\n",
    "            vector_results = self.vector_store.similarity_search(\n",
    "                query,\n",
    "                k=3  # Get top 3 most relevant results\n",
    "            )\n",
    "\n",
    "            # Format vector results for context\n",
    "            vector_context = \"\\n\".join([doc.page_content for doc in vector_results])\n",
    "\n",
    "            # Enhance the original query with vector context\n",
    "            enhanced_query = f\"\"\"\n",
    "            Consider this relevant context:\n",
    "            {vector_context}\n",
    "\n",
    "            Original question: {query}\n",
    "            \"\"\"\n",
    "\n",
    "            # Use the QA chain to get the final answer\n",
    "            response = self.qa_chain.run(enhanced_query)\n",
    "            return response\n",
    "\n",
    "        except Exception as e:\n",
    "            return f\"Error processing query: {str(e)}\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import json\n",
    "queries = [\n",
    "    \"Which buildings have the highest-rated restaurants within walking distance?\",\n",
    "    \"What are the best areas for families considering school ratings and park accessibility?\",\n",
    "    \"Find me buildings with good gym access and high-rated cafes nearby\",\n",
    "    \"Which areas have the best balance of transport connectivity and quiet surroundings?\",\n",
    "    \"Recommend buildings with both good supermarket access and restaurant options\",\n",
    "    \"I want to find a building with good restaurants and gyms nearby, preferably close to a metro station\"\n",
    "]\n",
    "#kg =Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"1234neo4j\"))\n",
    "\n",
    "rag = RealEstateRAG(llm,embedding_client)\n",
    "\n",
    "# Example query\n",
    "response = rag.answer_query(queries[4])\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from openai import AzureOpenAI\n",
    "from azure.core.credentials import AzureKeyCredential  # Add this import\n",
    "\n",
    "model_name = \"text-embedding-3-small\"\n",
    "deployment = \"text-embedding-3-small\"\n",
    "\n",
    "api_version = \"2024-02-01\"\n",
    "endpoint = os.getenv(\"AZURE_OPENAI_URL\")\n",
    "subscription_key = os.getenv(\"AZURE_OPENAI_EMBEDDING_KEY\")\n",
    "embedding_client = AzureOpenAI(\n",
    "    api_version=\"2024-12-01-preview\",\n",
    "    azure_endpoint=endpoint,\n",
    "    api_key=subscription_key\n",
    ")\n",
    "\n",
    "# response = embedding_client.embeddings.create(\n",
    "#     input=[\"first phrase\",\"second phrase\",\"third phrase\"],\n",
    "#     model=deployment\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "rag = RealEstateRAG(llm,embedding_client)\n",
    "test_query = \"Find me buildings with good restaurants nearby\"\n",
    "response = rag.answer_query(test_query)\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "newenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
